1.Create a pandas series from each of the items below: a list, numpy and a dictionary

In [2]:
import pandas as pd
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [9]:
ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)

In [11]:
print(ser1)
print(ser2)
print(ser3)

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int32
a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int32

2.Convert the series ser into a dataframe with its index as another column on the dataframe.

In [10]:
df=ser.to_frame().reset_index()
df

   index   0
0      a   0
1      b   1
2      c   2
3      e   3
4      d   4
5      f   5
6      g   6
7      h   7
8      i   8
9      j   9
10     k  10
11     l  11
12     m  12
13     n  13
14     o  14
15     p  15
16     q  16
17     r  17
18     s  18
19     t  19
20     u  20
21     v  21
22     w  22
23     x  23
24     y  24
25     z  25

4.Combine ser1 and ser2 to form a dataframe.

Input

In [12]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))
df=pd.concat([ser1,ser2],axis=1)
df

    0   1
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

5.Give a name to the series ser calling it ‘alphabets’.

Input

In [13]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [14]:
ser.name='alphabets'
print(ser)

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
Name: alphabets, dtype: object

6.From ser1 remove items present in ser2.

In [16]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [23]:
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

7.Get all items of ser1 and ser2 not common to both.

In [37]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser_u = pd.Series(np.union1d(ser1, ser2))  # union
ser_i = pd.Series(np.intersect1d(ser1, ser2))  # intersect
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

8.Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

In [46]:
ser = pd.Series(np.random.normal(10, 5, 25))
ser

0      4.448841
1      9.880680
2     10.933638
3     12.556663
4     14.663211
5      5.477136
6      3.688153
7      2.875380
8     10.138906
9     12.812280
10    12.348941
11     9.640590
12    10.083300
13    10.225000
14     5.939973
15     8.442126
16    14.373355
17    16.853078
18     5.063623
19     6.451315
20    12.550444
21    14.792807
22    14.170329
23     6.921937
24    12.144841
dtype: float64

In [52]:

print(np.percentile(ser,q=[0,25,50,75,100]))

[ 2.87538009  6.45131484 10.13890606 12.55666299 16.85307758]

9.Calculte the frequency counts of each unique value ser.

In [3]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

h    7
a    5
g    5
e    4
c    4
d    3
f    1
b    1
Name: count, dtype: int64

10.From ser, keep the top 2 most frequent items as it is and replace everything else as ‘Other’.

In [8]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

In [12]:
ser.value_counts()[:2]

2    6
1    3
Name: count, dtype: int64

In [10]:
print("Top 2 Freq:", ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

Top 2 Freq: 2    6
1    3
3    2
4    1
Name: count, dtype: int64

C:\Users\p2_ge\AppData\Local\Temp\ipykernel_4036\2399702148.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Other' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.
  ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'

0         1
1         2
2         2
3         2
4         1
5         2
6         2
7         1
8     Other
9         2
10    Other
11    Other
dtype: object

11.Bin the series ser into 10 equal deciles and replace the values with the bin name.

In [26]:
ser = pd.Series(np.random.random(20))
ser

0     0.959623
1     0.746716
2     0.339085
3     0.020716
4     0.343365
5     0.382936
6     0.645049
7     0.688503
8     0.744910
9     0.719560
10    0.257750
11    0.045839
12    0.996047
13    0.183509
14    0.883314
15    0.873163
16    0.741916
17    0.482847
18    0.073249
19    0.759789
dtype: float64

In [89]:
pd.qcut(ser, q=[0, .10, .20, .3, .4, .5, .6, .7, .8, .9, 1], 
        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0     3rd
1     2nd
2    10th
3     1st
4     8th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

12.Reshape the series ser into a dataframe with 7 rows and 5 columns

In [30]:
ser = pd.Series(np.random.randint(1, 10, 35))
ser=pd.DataFrame(ser.values.reshape(7,5))
ser

   0  1  2  3  4
0  8  4  4  2  9
1  8  4  8  2  9
2  3  6  3  3  8
3  6  9  8  5  1
4  5  6  7  5  9
5  8  8  7  5  4
6  5  6  3  9  8

13.Find the positions of numbers that are multiples of 3 from ser.

In [35]:
ser = pd.Series(np.random.randint(1, 10, 7))
ser

0    7
1    4
2    5
3    3
4    3
5    6
6    7
dtype: int32

In [41]:
print(ser[((ser%3)==0)])
np.argwhere(ser%3==0)

3    3
4    3
5    6
dtype: int32

array([[3],
       [4],
       [5]], dtype=int64)

14.From ser, extract the items at positions in list pos.

In [42]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
ser[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

15.Stack ser1 and ser2 vertically and horizontally (to form a dataframe).

In [43]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [50]:
serv=pd.concat([ser1,ser2],axis=0,ignore_index=True)
print(serv)
serh=pd.concat([ser1,ser2],axis=1,ignore_index=True)
print(serh)

0    0
1    1
2    2
3    3
4    4
5    a
6    b
7    c
8    d
9    e
dtype: object
   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

16.Get the positions of items of ser2 in ser1 as a list.

In [51]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

0     True
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8     True
dtype: bool

In [58]:
list(ser1[ser1.isin(ser2)].index)

[0, 4, 5, 8]

In [77]:
#opcion2
[np.where(i == ser1)[0].tolist()[0] for i in ser2]
#opcion 3
[pd.Index(ser1).get_loc(i) for i in ser2]

[5, 4, 0, 8]

17.Compute the mean squared error of truth and pred series.

In [78]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [79]:
np.mean((truth-pred)**2)

0.25250640687237763

18.Change the first character of each word to upper case in each word of ser.

In [93]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [99]:
ser.str.capitalize()

0     How
1      To
2    Kick
3    Ass?
dtype: object

19.How to calculate the number of characters in each word in a series?

In [102]:
ser.map(lambda x:len(x))

0    3
1    2
2    4
3    4
dtype: int64

20.Difference of differences between the consequtive numbers of ser.

In [119]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
print(ser.diff().tolist())
print(ser.diff().diff().tolist())

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

21.How to convert a series of date-strings to a timeseries?

In [123]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
ser.map(lambda x:pd.to_datetime(x))

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

22.Get the day of month, week number, day of year and day of week from ser.

In [152]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
ser2=ser.map(lambda x:pd.to_datetime(x))

In [183]:
from dateutil.parser import parse
ser_ts = ser.map(lambda x: parse(x))
dias=['lunes','martes','miercoles','jueves','viernes','sabado',]
print(list(ser_ts.dt.day))
print(list(ser_ts.dt.strftime('%A')))
print(list(ser_ts.dt.strftime('%W')))
print(list(ser_ts.dt.day_of_year))

[1, 2, 3, 4, 5, 6]
['Friday', 'Wednesday', 'Saturday', 'Thursday', 'Monday', 'Saturday']
['00', '05', '09', '13', '18', '22']
[1, 33, 63, 94, 125, 157]